Conf.Simple/src/DataProcessors/SUI_НастройкаМетаданных/SUI_НастройкаМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_НастройкаМетаданных</name>
</mdclass:DataProcessor>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ТаблицыКПерезаписиВМУ/SUI_ТаблицыКПерезаписиВМУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ТаблицыКПерезаписиВМУ</name>
  <dimensions>
    <name>Таблица</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/DataProcessors/SUI_НастройкаМетаданных/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем МодифицированностьТаблицИнтеграции;

&НаКлиенте
Перем СписокТаблицКОбновлению;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗначениеВРеквизитФормы(СформироватьДеревоТаблицИнтеграции(), "ДеревоТаблицИнтеграции");
	УстановитьУсловноеОформлениеДереваТаблицыИнтеграции();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодифицированностьТаблицИнтеграции = Ложь;
	
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если МодифицированностьТаблицИнтеграции Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграции", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Настройки таблиц интеграции были модифицированны.
		|Выполнить выгрузку таблиц?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаборКонстантSUI_ИспользоватьПользовательскийЗапросПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоТаблицИнтеграции

&НаКлиенте
Процедура ДеревоТаблицИнтеграцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ДеревоТаблицИнтеграцииТаблицаИнтеграции" Тогда
		ОткрытьНастройкуТаблицыИнтеграции();
	ИначеЕсли Поле.Имя = "ДеревоТаблицИнтеграцииДополнительныеНастройки" Тогда
		ОткрытьДополнительныеНастройкиТаблицыИнтеграции();
	ИначеЕсли Поле.Имя = "ДеревоТаблицИнтеграцииКоличествоЗаписей" Тогда
		ОткрытьТаблицуИнтеграции();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоТаблицИнтеграцииИспользуетсяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("ТаблицаИнтеграции", ТекущиеДанные.ТаблицаИнтеграции);
	Контекст.Вставить("Используется", ТекущиеДанные.Используется);
	
	Оповещение = Новый ОписаниеОповещения("ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы", ЭтотОбъект, Контекст);
	
	Если ТекущиеДанные.Используется Или 
		ТекущиеДанные.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Или 
		ТекущиеДанные.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Или 
		ТекущиеДанные.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	Иначе
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Очистить таблицу?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДеревоТаблицыИнтеграции(Команда)
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТаблицуИнтеграцииКоманда(Команда)
	ОткрытьТаблицуИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВсеТаблицыИнтеграции(Команда)

	Контекст = Новый Структура();
	Контекст.Вставить("ТаблицыИнтеграции", Новый Массив());
	Контекст.Вставить("Используется", Истина);
	
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		Если Не СтрокаДерева.Используется Тогда
			Контекст.ТаблицыИнтеграции.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			СтрокаДерева.Используется = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Контекст.ТаблицыИнтеграции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы", ЭтотОбъект, Контекст);
	ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеИспользованиеТаблиц(Команда)
	
	Контекст = Новый Структура();
	Контекст.Вставить("ТаблицыИнтеграции", Новый Массив());
	Контекст.Вставить("Используется", Ложь);
	
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.Используется Тогда
			Контекст.ТаблицыИнтеграции.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			СтрокаДерева.Используется = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы", ЭтотОбъект, Контекст);
	
	Если Контекст.ТаблицыИнтеграции.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Контекст.ТаблицыИнтеграции.Количество() = 1 И
		(Контекст.ТаблицыИнтеграции.Найти(ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД")) <> Неопределено Или
		Контекст.ТаблицыИнтеграции.Найти(ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры")) <> Неопределено Или
		Контекст.ТаблицыИнтеграции.Найти(ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок")) <> Неопределено) Тогда
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	Иначе
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Очистить таблицы?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуТаблицыИнтеграцииКоманда(Команда)
	ОткрытьНастройкуТаблицыИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныеНастройкиТаблицыИнтеграцииКоманда(Команда)
	ОткрытьДополнительныеНастройкиТаблицыИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТаблицуИнтеграции(Команда)
	
	ВыполнитьДействиеСТаблицами("Выгрузить");

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуИнтеграции(Команда)
	
	ВыполнитьДействиеСТаблицами("Очистить");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьТаблицуИнтеграцииВМУ(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаписатьТаблицуИнтеграцииВМУНаСервере(ТекущиеДанные.ТаблицаИнтеграции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскийЗапрос(Команда)
	
	ПараметрыОткрытияКонструктора = SUI_КонструкторЗапросаКлиентСервер.ПараметрыОткрытияКонструктора();
	ПараметрыОткрытияКонструктора.Данные = 
		SUI_НастройкиМетаданныхВызовСервера.ПолучитьПользовательскийЗапрос();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьПользовательскийЗапросЗавершение", ЭтотОбъект);
	
	SUI_КонструкторЗапросаКлиент.ОткрытьКонструктор(ПараметрыОткрытияКонструктора, ОповещениеОЗавершении, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросПолученияОстатковИЦен(Команда)
	
	ПараметрыОткрытияКонструктора = SUI_КонструкторЗапросаКлиентСервер.ПараметрыОткрытияКонструктора();
	ПараметрыОткрытияКонструктора.ОтображатьНастройкиРезультатаЗапроса = Ложь;
	ПараметрыОткрытияКонструктора.Данные = ПолучитьЗапросПолученияОстатковИЦен();
	ПараметрыОткрытияКонструктора.ОписаниеЗапроса = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = '<b>Результат запроса должен возращать колонки:</b>
		|
		|<b>purpose</b> = Склад
		|<b>id_good</b> = Номенклатура
		|<b>good_name</b> = Наименование номенклатуры
		|<b>article</b> = Артикул номенклатуры
		|<b>id_property</b> = Характеристика
		|<b>property_name</b> = Наименование характеристики
		|<b>representation</b> = Представление результата
		|<b>qtty</b> = Количество остаток
		|<b>price_new</b> = Цена (текущая)
		|<b>price_old</b> = Цена (старая)'"));

	SUI_КонструкторЗапросаКлиентСервер.ДобавитьОписаниеПараметра(ПараметрыОткрытияКонструктора, 
		"Номенклатура", Неопределено, НСтр("ru = 'Номенклатура'"));
	SUI_КонструкторЗапросаКлиентСервер.ДобавитьОписаниеПараметра(ПараметрыОткрытияКонструктора, 
		"Характеристика", Неопределено, НСтр("ru = 'Характеристика номенклатуры'"));
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьЗапросПолученияОстатковИЦенЗавершение", ЭтотОбъект);
	
	SUI_КонструкторЗапросаКлиент.ОткрытьКонструктор(ПараметрыОткрытияКонструктора, ОповещениеОЗавершении, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределеннойНастройкой(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПредопределеннойНастройкойЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ЗагрузкаПредопределенных", Истина);
	ПараметрыОткрытия.Вставить("ЗакрытьПослеЗаписи", Истина);
	
	ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия, ОповещениеОЗавершении);
	
	//SUI_НастройкиМетаданныхКлиент.ЗаполнитьПредопределеннойНастройкой(ЭтотОбъект, ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройкиВФайл(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОтключитьРежимЗагрузки", Истина);
	ПараметрыОткрытия.Вставить("ЗаполнитьВсеПриОткрытииВыгрузки", Истина);
	
	ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия);
	
	//SUI_НастройкиМетаданныхКлиент.ВыгрузитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОтключитьРежимВыгрузки", Истина);
	ПараметрыОткрытия.Вставить("ВыборФайлаПриОткрытииВыгрузки", Истина);
	ПараметрыОткрытия.Вставить("ЗакрытьПослеЗаписи", Истина);
	
	ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия, ОповещениеОЗавершении);
	
	//SUI_НастройкиМетаданныхКлиент.ЗагрузитьНастройки(ЭтотОбъект, ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия, ОповещениеОЗавершении = Неопределено)
	
	ПараметрыОткрытия.Вставить("ОбластиНастроек", Новый СписокЗначений());
	
	// Области настроек
	ПараметрыОткрытия.ОбластиНастроек.Добавить("IntegrationTables");
	ПараметрыОткрытия.ОбластиНастроек.Добавить("IntegrationAdditional");
	ПараметрыОткрытия.ОбластиНастроек.Добавить("IntegrationQuery");
	
	ОткрытьФорму("Обработка.SUI_ВыгрузкаЗагрузкаНастроек.Форма", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , ОповещениеОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СформироватьДеревоТаблицИнтеграции()
	
	ТаблицыИнтеграции = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграции();
	ТаблицыИнтеграции.СортироватьПоПредставлению();
	
	ТаблицыСДополнительнымиНастройками = Новый Массив();
	ТаблицыСДополнительнымиНастройками.Добавить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры);
	ТаблицыСДополнительнымиНастройками.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	ТаблицыСДополнительнымиНастройками.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	ДеревоТаблиц = Новый ДеревоЗначений();
	ДеревоТаблиц.Колонки.Добавить("ТаблицаИнтеграции");
	ДеревоТаблиц.Колонки.Добавить("ИмяМетаданных");
	ДеревоТаблиц.Колонки.Добавить("Используется");
	ДеревоТаблиц.Колонки.Добавить("ДополнительныеНастройки");
	ДеревоТаблиц.Колонки.Добавить("КоличествоЗаписей");
	ДеревоТаблиц.Колонки.Добавить("Модифицированность");
	ДеревоТаблиц.Колонки.Добавить("ИндексКартинки");
	
	Для Каждого ТаблицаИнтеграции Из ТаблицыИнтеграции Цикл

		СтрокаДерева 					= ДеревоТаблиц.Строки.Добавить();
		СтрокаДерева.ТаблицаИнтеграции 	= ТаблицаИнтеграции.Значение;
		СтрокаДерева.ИмяМетаданных 		= SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(СтрокаДерева.ТаблицаИнтеграции);
		
		Если ТаблицыСДополнительнымиНастройками.Найти(СтрокаДерева.ТаблицаИнтеграции) <> Неопределено Тогда
			СтрокаДерева.ДополнительныеНастройки = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Возврат ДеревоТаблиц;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеДереваТаблицыИнтеграции()
	
	// Цвет гиперссылки Таблица интеграции
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииТаблицаИнтеграции");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.Используется");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Цвет гиперссылки Дополнительные настройки
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииДополнительныеНастройки");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.Используется");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Цвет гиперссылки Количество записей
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииКоличествоЗаписей");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.Используется");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Отобразить гиперссылки Дополнительные настройки
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииДополнительныеНастройки");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.ДополнительныеНастройки");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Дополнительные настройки'"));

	// Скрыть гиперссылку Дополнительные настройки
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииДополнительныеНастройки");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.ДополнительныеНастройки");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Ложь;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	// Отобразить как гиперссылку Количество записей когда 0
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииКоличествоЗаписей");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.КоличествоЗаписей");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение 	= 0;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '0'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы(Ответ, Контекст) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьТаблицу = Истина;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ОчиститьТаблицу = Ложь;
	Иначе
		Возврат;
	КонецЕсли;

	ОписаниеТипаТаблицаИнтеграции = Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции");
	
	ТаблицыКОбработке = Новый СписокЗначений();
	
	Если Контекст.Свойство("ТаблицаИнтеграции") И 
		Не ОписаниеТипаТаблицаИнтеграции.ПривестиЗначение(Контекст.ТаблицаИнтеграции).Пустая() Тогда
		ТаблицыКОбработке.Добавить(Контекст.ТаблицаИнтеграции);
	ИначеЕсли Контекст.Свойство("ТаблицыИнтеграции") Тогда
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		Для Каждого ТаблицаИнтеграции Из ОписаниеТипаМассив.ПривестиЗначение(Контекст.ТаблицыИнтеграции) Цикл
			Если Не ОписаниеТипаТаблицаИнтеграции.ПривестиЗначение(ТаблицаИнтеграции).Пустая() Тогда
				ТаблицыКОбработке.Добавить(ТаблицаИнтеграции);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТаблицыКОбработке.Количество() = 0 Тогда
		Возврат;
	Иначе
		ТаблицыКОбработке.ЗаполнитьПометки(Контекст.Используется);
	КонецЕсли;
	
	ИспользованиеТаблицыИнтеграцииНаСервере(ТаблицыКОбработке, ОчиститьТаблицу);
	
	СписокТаблицКОбновлению = ТаблицыКОбработке.ВыгрузитьЗначения();
	
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновлениеИнтерфейса", 0.2, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИспользованиеТаблицыИнтеграцииНаСервере(КоллекцияТаблицИнтеграции, ОчищатьТаблицы)
	
	ОписаниеТипаСписокЗначений = Новый ОписаниеТипов("СписокЗначений");
	Для Каждого ТаблицаИнтеграции Из ОписаниеТипаСписокЗначений.ПривестиЗначение(КоллекцияТаблицИнтеграции) Цикл
		SUI_НастройкиМетаданныхСервер.УстановитьПризнакИспользованияТаблицы(ТаблицаИнтеграции.Значение, 
			ТаблицаИнтеграции.Пометка, ?(Не ТаблицаИнтеграции.Пометка И ОчищатьТаблицы, Истина, Ложь));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИнтерфейса() Экспорт
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	ОбновитьПовторноИспользуемыеЗначения();

	Если ОбновлятьИнтерфейс Тогда
		ПодключитьОбработчикОжидания("ОбновлениеИнтерфейса", 2, Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	УстановитьВидимостьИДоступность();
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	
	Если ЧастиИмени.Количество() = 2 Тогда
		КонстантаИмя = ЧастиИмени[1];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
	ИначеЕсли ЧастиИмени.Количество() = 1 И НРег(Лев(РеквизитПутьКДанным, 9)) = НРег("Константа") Тогда
		КонстантаИмя = Сред(РеквизитПутьКДанным, 10);
		КонстантаЗначение = ЭтотОбъект[РеквизитПутьКДанным];
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если Константы[КонстантаИмя].Получить() <> КонстантаЗначение Тогда
		Константы[КонстантаИмя].Установить(КонстантаЗначение);
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИДоступность(РеквизитПутьКДанным = "")
	
	Элементы.ОткрытьПользовательскийЗапрос.Доступность = НаборКонстант.SUI_ИспользоватьПользовательскийЗапрос;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции() Экспорт
	
	ДлительнаяОперация = ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииНаСервере(СписокТаблицКОбновлению);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершение", 
		ЭтотОбъект, Новый Структура("ВсеТаблицы", (СписокТаблицКОбновлению = Неопределено)));
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииНаСервере(СписокТаблиц = Неопределено)

	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("СписокТаблиц", СписокТаблиц);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.SUI_НастройкаМетаданных.ПолучитьКоличествоЗаписейВТаблицахИнтеграции", 
		ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	СписокТаблицКОбновлению = Неопределено;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершениеНаСервере(Результат.АдресРезультата, 
			ДополнительныеПараметры.ВсеТаблицы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершениеНаСервере(АдресРезультата, ВсеТаблицы)
	
	ТаблицаКоличествоЗаписей = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		
		НайденныеСтроки = ТаблицаКоличествоЗаписей.НайтиСтроки(Новый Структура("ТаблицаИнтеграции", СтрокаДерева.ТаблицаИнтеграции));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			Если ВсеТаблицы Тогда
				СтрокаДерева.КоличествоЗаписей = 0;
				СтрокаДерева.Используется = Ложь;
				СтрокаДерева.ИндексКартинки = 9;
			КонецЕсли;
			
		Иначе
			СтрокаДерева.КоличествоЗаписей = НайденныеСтроки[0].КоличествоЗаписей;
			СтрокаДерева.Используется = НайденныеСтроки[0].Используется;
			СтрокаДерева.ИндексКартинки = НайденныеСтроки[0].ИндексКартинки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуТаблицыИнтеграции()
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ТаблицаИнтеграции", ТекущиеДанные.ТаблицаИнтеграции);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьНастройкуТаблицыИнтеграцииЗавершение", ЭтотОбъект, 
		Элементы.ДеревоТаблицИнтеграции.ТекущаяСтрока);
		
	ОткрытьФорму("РегистрСведений.SUI_НастройкиТаблицИнтеграции.Форма.НастройкаТаблиц", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , ОповещениеОЗавершении);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуТаблицыИнтеграцииЗавершение(НастройкаИзменена, ИдентификаторСтрокиДерева) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкаИзменена) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ДеревоТаблицИнтеграции.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	
	Если Данные <> Неопределено И Данные.Используется Тогда
		Данные.Модифицированность = Истина;
		МодифицированностьТаблицИнтеграции = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныеНастройкиТаблицыИнтеграции()
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ТекущиеДанные.ДополнительныеНастройки Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений();
	
	Если ТекущиеДанные.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
		СписокВыбора.Добавить("РедакторКода_АлгоритмНормализации", НСтр("ru = 'Алгоритм нормализации'"));
		СписокВыбора.Добавить("РедакторКода_АлгоритмСоздания", НСтр("ru = 'Алгоритм создания'"));
	ИначеЕсли ТекущиеДанные.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Тогда
		СписокВыбора.Добавить("РедакторКода_АлгоритмСоздания", НСтр("ru = 'Алгоритм создания'"));
	ИначеЕсли ТекущиеДанные.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры") Тогда
		СписокВыбора.Добавить("РедакторКода_АлгоритмСоздания", НСтр("ru = 'Алгоритм создания'"));
	КонецЕсли;
	
	Если СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("Таблица", ТекущиеДанные.ТаблицаИнтеграции);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьДополнительныеНастройкиТаблицыДетальныйВыбор", ЭтотОбъект, Контекст);
	
	ПоказатьВыборИзМеню(ОповещениеОЗавершении, СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныеНастройкиТаблицыДетальныйВыбор(Ключ, Контекст) Экспорт
	
	Если Ключ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Вставить("Ключ", Ключ.Значение);
	
	Если СтрНачинаетсяС(Контекст.Ключ, "РедакторКода_") Тогда
		
		Контекст.Вставить("Ключ", СтрЗаменить(Контекст.Ключ, "РедакторКода_", ""));
		Контекст.Вставить("ДополнительныеНастройки", ПолучитьДополнительныеНастройки(Контекст.Таблица));
		
		ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия();
		ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Истина;
		
		Если Контекст.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
			
			// Алгоритм нормализации значения Штрихкода упаковки
			Если Контекст.Ключ = "АлгоритмНормализации" Тогда
				
				Контекст.Вставить("КлючНастройки", "АлгоритмНормализацииЗначенияШтрихкода.Алгоритм");
				
				ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм нормализации значения штрихкода упаковки'");
				ПараметрыОткрытияРедактора.Описание = НСтр("ru = 'Результат выполнения алгоритма необходимо присвоить переменной ""ЗначениеШтрихкода"".'");
				ПараметрыОткрытияРедактора.ИсходныйТекст = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
					Контекст.ДополнительныеНастройки, Контекст.КлючНастройки, "", Тип("Строка"));
				ПараметрыОткрытияРедактора.ПредопределенныйТекст = SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныйАлгоритмНормализацииЗначенияШтрихкода();
				
				// Переменная редактора: ЗначениеШтрихкода
				SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
					"ЗначениеШтрихкода", НСтр("ru = 'Значение штрихкода'"), Тип("Строка"));
				
			// Алгоритм создания Штрихкода упаковки
			ИначеЕсли Контекст.Ключ = "АлгоритмСоздания" Тогда
				
				Контекст.Вставить("КлючНастройки", "АлгоритмСозданияШтрихкодаУпаковки.Алгоритм");
				
				ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм создания штрихкода упаковки'");
				ПараметрыОткрытияРедактора.Описание = НСтр("ru = 'Результат выполнения алгоритма необходимо присвоить переменной ""ШтрихкодУпаковки"".'");
				ПараметрыОткрытияРедактора.ИсходныйТекст = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
					Контекст.ДополнительныеНастройки, Контекст.КлючНастройки, "", Тип("Строка"));
				ПараметрыОткрытияРедактора.ПредопределенныйТекст = SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныйАлгоритмСозданияШтрихкодаУпаковки();
				
				// Переменная редактора: ЗначениеШтрихкода
				SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
					"ЗначениеШтрихкода", НСтр("ru = 'Значение штрихкода'"), Тип("Строка"));
				// Переменная редактора: ШтрихкодУпаковки
				SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
					"ШтрихкодУпаковки", НСтр("ru = 'Штрихкод упаковки'"), "Произвольный");
				// Переменная редактора: Номенклатура
				SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
					"Номенклатура", НСтр("ru = 'Номенклатура штрихкода упаковки'"), "Произвольный");
				// Переменная редактора: Характеристика
				SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
					"Характеристика", НСтр("ru = 'Характеристика штрихкода упаковки'"), "Произвольный");
				// Переменная редактора: Штрихкод
				SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
					"Упаковка", НСтр("ru = 'Упаковка штрихкода упаковки'"), "Произвольный");
				
			КонецЕсли;
		
		// Алгоритм создания Серии номенклатуры
		ИначеЕсли Контекст.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Тогда
			
			Контекст.Вставить("КлючНастройки", "АлгоритмСозданияСерииНоменклатуры.Алгоритм");
			
			ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм создания серии номенклатуры'");
			ПараметрыОткрытияРедактора.Описание = НСтр("ru = 'Результат выполнения алгоритма необходимо присвоить переменной ""Серия"".'");
			ПараметрыОткрытияРедактора.ИсходныйТекст = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				Контекст.ДополнительныеНастройки, Контекст.КлючНастройки, "", Тип("Строка"));
			ПараметрыОткрытияРедактора.ПредопределенныйТекст = SUI_СерииНоменклатурыКлиентСервер.ПредопределенныйАлгоритмСозданияСерииНоменклатуры();
			
			// Переменная редактора: Штрихкод
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Серия", НСтр("ru = 'Серия номенклатуры'"), "Произвольный");
			// Переменная редактора: Номенклатура
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Номенклатура", НСтр("ru = 'Номенклатура'"), "Произвольный");
			// Переменная редактора: Характеристика
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Характеристика", НСтр("ru = 'Характеристика'"), "Произвольный");
			// Переменная редактора: Наименование
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Наименование", НСтр("ru = 'Наименование серии'"), Тип("Строка"));
			// Переменная редактора: Номер
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Номер", НСтр("ru = 'Номер серии'"), Тип("Строка"));
			// Переменная редактора: ДатаПроизводства
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"ДатаПроизводства", НСтр("ru = 'Дата производства серии'"), Тип("Дата"));
			// Переменная редактора: ГоденДо
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"ГоденДо", НСтр("ru = 'Срок годности серии'"), Тип("Дата"));
			// Переменная редактора: КоличествоФакт
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"КоличествоФакт", НСтр("ru = 'Количество серии'"), Тип("Число"));
		
		// Алгоритм создания Штрихкода номенклатуры
		ИначеЕсли Контекст.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры") Тогда
			
			Контекст.Вставить("КлючНастройки", "АлгоритмСозданияШтрихкодаНоменклатуры.Алгоритм");
			
			ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм создания штрихкода номенклатуры'");
			ПараметрыОткрытияРедактора.ИсходныйТекст = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				Контекст.ДополнительныеНастройки, Контекст.КлючНастройки, "", Тип("Строка"));
			ПараметрыОткрытияРедактора.ПредопределенныйТекст = SUI_ШтрихкодыНоменклатурыКлиентСервер.ПредопределенныйАлгоритмСозданияШтрихкодаНоменклатуры();
			
			// Переменная редактора: Штрихкод
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Штрихкод", НСтр("ru = 'Значение штрихкода'"), Тип("Строка"));
			// Переменная редактора: Номенклатура
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Номенклатура", НСтр("ru = 'Номенклатура'"), "Произвольный");
			// Переменная редактора: Характеристика
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Характеристика", НСтр("ru = 'Характеристика'"), "Произвольный");
			// Переменная редактора: Штрихкод
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Упаковка", НСтр("ru = 'Упаковка'"), "Произвольный");
			
		КонецЕсли;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьДополнительныеНастройкиТаблицы_РедакторКодаЗаверешение", 
			ЭтотОбъект, Контекст);
		SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, ОповещениеОЗавершении, ЭтотОбъект, Окно);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДополнительныеНастройки(Таблица, АдресСохранения = Неопределено)
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ДополнительныеНастройки = ОписаниеТипаСтруктура.ПривестиЗначение(
		SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(Таблица, Ложь));
	
	Если ТипЗнч(АдресСохранения) = Тип("Строка") И ЭтоАдресВременногоХранилища(АдресСохранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(ДополнительныеНастройки, АдресСохранения);
	Иначе
		Возврат ДополнительныеНастройки;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьДополнительныеНастройки(Таблица, ДополнительныеНастройки)
	
	Если ТипЗнч(ДополнительныеНастройки) = Тип("Строка") И ЭтоАдресВременногоХранилища(ДополнительныеНастройки) Тогда
		SUI_НастройкиМетаданныхСервер.СохранитьДополнительныеНастройки(Таблица, ПолучитьИзВременногоХранилища(ДополнительныеНастройки));
	Иначе
		SUI_НастройкиМетаданныхСервер.СохранитьДополнительныеНастройки(Таблица, ДополнительныеНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныеНастройкиТаблицы_РедакторКодаЗаверешение(ОтредактированныйКод, Контекст) Экспорт
	
	Если ОтредактированныйКод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ключи = СтрРазделить(Контекст.КлючНастройки, ".");
	ГраницаКлюча = Ключи.ВГраница();
	ТекущийЭлементДопНастроек = Контекст.ДополнительныеНастройки;
	Для индекс = 0 По ГраницаКлюча Цикл
		Если индекс = ГраницаКлюча Тогда
			ТекущийЭлементДопНастроек.Вставить(Ключи[индекс], ОтредактированныйКод);
		Иначе
			Если Не ТекущийЭлементДопНастроек.Свойство(Ключи[индекс]) Или ТипЗнч(ТекущийЭлементДопНастроек[Ключи[индекс]]) <> Тип("Структура") Тогда
				ТекущийЭлементДопНастроек.Вставить(Ключи[индекс], Новый Структура());
			КонецЕсли;
			ТекущийЭлементДопНастроек = ТекущийЭлементДопНастроек[Ключи[индекс]];
		КонецЕсли;
	КонецЦикла;
	
	СохранитьДополнительныеНастройки(Контекст.Таблица, Контекст.ДополнительныеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТаблицуИнтеграции()
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьТаблицуИнтеграцииЗавершение", ЭтотОбъект);
	ОткрытьФорму(ТекущиеДанные.ИмяМетаданных + ".ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТаблицуИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеСТаблицами(Действие, ОповещениеОЗавершении = Неопределено)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;

	Контекст = Новый Структура();
	Контекст.Вставить("Действие", ВРег(Действие));
	
	Если ТипЗнч(ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
		Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	КонецЕсли;

	Если Контекст.Действие = "ВЫГРУЗИТЬ" Тогда
		ТекстЗаголовка = НСтр("ru = 'Выгрузить таблицы:'");
	ИначеЕсли Контекст.Действие = "ОЧИСТИТЬ" Тогда
		ТекстЗаголовка = НСтр("ru = 'Очистить таблицы:'");
	Иначе
		Возврат;
	КонецЕсли;
	
	КнопкиВопроса = Новый СписокЗначений();
	
	Если ТекущиеДанные <> Неопределено И
		ТекущиеДанные.ТаблицаИнтеграции <> ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") И
		ТекущиеДанные.ТаблицаИнтеграции <> ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") И
		ТекущиеДанные.ТаблицаИнтеграции <> ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
		КнопкиВопроса.Добавить("ПоИдентификаторуСтроки", ТекущиеДанные.ТаблицаИнтеграции);
		Контекст.Вставить("ИдентификаторСтроки", Элементы.ДеревоТаблицИнтеграции.ТекущаяСтрока);
	Иначе
		Контекст.Вставить("ИдентификаторСтроки");
	КонецЕсли;
	
	КнопкиВопроса.Добавить("Используемые", НСтр("ru = 'Используемые таблицы'"));
	КнопкиВопроса.Добавить("Модифицированные", НСтр("ru = 'По модифицированным настройкам'"));
	КнопкиВопроса.Добавить("ВыбратьИзСписка", НСтр("ru = 'Выбрать из списка'"));
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	Оповещение = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбора", ЭтотОбъект, Контекст);
	ПоказатьВопрос(Оповещение, , КнопкиВопроса, 15, КодВозвратаДиалога.Отмена, ТекстЗаголовка, КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеВыбора(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Контекст.Вставить("КонтекстДействия", РезультатВыбора);

	ТаблицыКОбработкеДействием = Новый СписокЗначений();

	Если РезультатВыбора = "ПоИдентификаторуСтроки" И Контекст.ИдентификаторСтроки <> Неопределено Тогда

		ТекущиеДанные = ДеревоТаблицИнтеграции.НайтиПоИдентификатору(Контекст.ИдентификаторСтроки);
		Если ТекущиеДанные <> Неопределено Тогда
			ТаблицыКОбработкеДействием.Добавить(ТекущиеДанные.ТаблицаИнтеграции);
		КонецЕсли;
		
		ТаблицыКОбработкеДействием.ЗаполнитьПометки(Истина);
	
	Иначе
		
		Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
			
			Если (РезультатВыбора = "Используемые" И Не СтрокаДерева.Используется)
				Или (РезультатВыбора = "Модифицированные" И Не СтрокаДерева.Модифицированность) Или
				СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Или
				СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Или
				СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры") Тогда
				Продолжить;
			КонецЕсли;

			ТаблицыКОбработкеДействием.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			
		КонецЦикла;
		
		Если РезультатВыбора = "Используемые" Или РезультатВыбора = "Модифицированные" Тогда
			ТаблицыКОбработкеДействием.ЗаполнитьПометки(Истина);
		КонецЕсли;
		
		Контекст.Вставить("ПоказатьОтметкуЭлементов");
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ТаблицыКОбработкеДействием) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить", ЭтотОбъект, Контекст);
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ТаблицыКОбработкеДействием);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отсутствуют доступные таблицы для выполнения действия.'"));
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить(ТаблицыКОбработке, Контекст) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицыКОбработке) Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Контекст.Свойство("ПоказатьОтметкуЭлементов") Тогда
		Контекст.Удалить("ПоказатьОтметкуЭлементов");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить", ЭтотОбъект, Контекст);
		ТаблицыКОбработке.ПоказатьОтметкуЭлементов(ОповещениеОЗавершении, НСтр("ru = 'Выберите таблицы'"));
		Возврат;
	КонецЕсли;

	МассивТаблицКОбработке = Новый Массив();
	Для Каждого ТаблицаКОбработке Из ТаблицыКОбработке Цикл

		Если ТаблицаКОбработке.Пометка Тогда
			
			Если ТаблицаКОбработке.Значение = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Или
				ТаблицаКОбработке.Значение = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Или
				ТаблицаКОбработке.Значение = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
				ТаблицаКОбработке.Пометка = Ложь;
				Продолжить;
			КонецЕсли;
			
			МассивТаблицКОбработке.Добавить(ТаблицаКОбработке.Значение);
			
		КонецЕсли;

	КонецЦикла;
	
	Если МассивТаблицКОбработке.Количество() = 0 Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НеиспользуемыеТаблицы = Новый Массив();
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		
		Если МассивТаблицКОбработке.Найти(СтрокаДерева.ТаблицаИнтеграции) <> Неопределено И
			Не СтрокаДерева.Используется Тогда
			НеиспользуемыеТаблицы.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			СтрокаДерева.Модифицированность = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Контекст.Действие = "ВЫГРУЗИТЬ" Тогда

		МассивТаблицКОбработке = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивТаблицКОбработке, НеиспользуемыеТаблицы);
		
		Для индекс = 0 По НеиспользуемыеТаблицы.ВГраница() Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Таблица %1 не используется. Выгрузка для таблицы не будет выполнена.'"), 
				НеиспользуемыеТаблицы[индекс]));
		КонецЦикла;
	
	КонецЕсли;
	
	Если МассивТаблицКОбработке.Количество() = 0 Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ТекстаВопроса = СтрШаблон(НСтр("ru = 'Будет выполнена #ДЕЙСТВИЕ таблиц:
	|
	|%1
	|
	|Продолжить?'"), СтрСоединить(МассивТаблицКОбработке, Символы.ПС));
	
	КнопкиВопроса = Новый СписокЗначений();
	
	Если Контекст.Действие = "ВЫГРУЗИТЬ" Тогда
		ТекстаВопроса = СтрЗаменить(ТекстаВопроса, "#ДЕЙСТВИЕ", "выгрузка");
		КнопкиВопроса.Добавить("ОчиститьИВыгрузить", НСтр("ru = 'Очистить и выгрузить'"));
		КнопкиВопроса.Добавить("Выгрузить", НСтр("ru = 'Выгрузить'"));
	ИначеЕсли Контекст.Действие = "ОЧИСТИТЬ" Тогда
		ТекстаВопроса = СтрЗаменить(ТекстаВопроса, "#ДЕЙСТВИЕ", "очистка");
		КнопкиВопроса.Добавить("Очистить", НСтр("ru = 'Очистить'"));
	Иначе
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	Контекст.Вставить("ТаблицыКОбработке", МассивТаблицКОбработке);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеПослеПодтверждения", 
		ЭтотОбъект, Контекст);
	
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстаВопроса, КнопкиВопроса, 15);

КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеПослеПодтверждения(Ответ, Контекст) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеПослеПодтвержденияЗавершение", 
		ЭтотОбъект, Контекст);
	
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("СписокТаблиц", Контекст.ТаблицыКОбработке);
	
	Если Ответ = "Выгрузить" Или Ответ = "ОчиститьИВыгрузить" Тогда

		Если Ответ = "ОчиститьИВыгрузить" Тогда
			ПараметрыОперации.Вставить("ОчиститьТаблицу", Истина);
		КонецЕсли;
		
		SUI_ИнтеграцияВКонфигурациюКлиент.ЗаписатьВТаблицы(ЭтотОбъект, ПараметрыОперации, ОповещениеОЗавершении);
		
	ИначеЕсли Ответ = "Очистить" Тогда
		SUI_ИнтеграцияВКонфигурациюКлиент.ОчиститьТаблицы(ЭтотОбъект, ПараметрыОперации, ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеПослеПодтвержденияЗавершение(Результат, Контекст) Экспорт
	
	Если Результат Тогда
	
		МодифицированностьТаблицИнтеграции = Ложь;
		
		Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
			
			Если Не СтрокаДерева.Модифицированность Тогда
				Продолжить;
			КонецЕсли;
			
			Если Контекст.ТаблицыКОбработке.Найти(СтрокаДерева.ТаблицаИнтеграции) = Неопределено Тогда
				МодифицированностьТаблицИнтеграции = Истина;
			Иначе
				СтрокаДерева.Модифицированность = Ложь;
			КонецЕсли;
			
		КонецЦикла;
	
		ПодключитьОбработчикОжидания("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции", 0.2, Истина);
	
	КонецЕсли;
	
	Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскийЗапросЗавершение(ДанныеКонструктора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДанныеКонструктора) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;

	SUI_НастройкиМетаданныхВызовСервера.СохранитьПользовательскийЗапрос(ДанныеКонструктора);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗапросПолученияОстатковИЦен()
	Возврат SUI_НастройкиМетаданныхСервер.ПолучитьЗапросПолученияОстатковИЦен();
КонецФункции

&НаКлиенте
Процедура ОткрытьЗапросПолученияОстатковИЦенЗавершение(ДанныеКонструктора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДанныеКонструктора) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;

	ЗапросПолученияОстатковИЦенПослеЗакрытияНаСервере(ДанныеКонструктора);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапросПолученияОстатковИЦенПослеЗакрытияНаСервере(ДанныеКонструктора)
	SUI_НастройкиМетаданныхСервер.СохранитьЗапросПолученияОстатковИЦен(ДанныеКонструктора);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграции(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		МодифицированностьТаблицИнтеграции = Ложь;
		Закрыть();
		Возврат;
	ИначеЕсли Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыКОбработкеДействием = Новый СписокЗначений();
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
			
		Если Не СтрокаДерева.Модифицированность Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
			Продолжить;
		КонецЕсли;

		ТаблицыКОбработкеДействием.Добавить(СтрокаДерева.ТаблицаИнтеграции);
		
	КонецЦикла;
	
	ТаблицыКОбработкеДействием.ЗаполнитьПометки(Истина);
		
	Контекст = Новый Структура();
	Контекст.Вставить("Действие", "ВЫГРУЗИТЬ");
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения(
		"ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграцииЗавершение", ЭтотОбъект));
		
	ОповещениеВыполнения = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить", ЭтотОбъект, Контекст);
	ВыполнитьОбработкуОповещения(ОповещениеВыполнения, ТаблицыКОбработкеДействием);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределеннойНастройкойЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОписаниеТипаСписок = Новый ОписаниеТипов("СписокЗначений");
	Если ОписаниеТипаСписок.ПривестиЗначение(Результат).Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	МодифицированностьТаблицИнтеграции = Ложь;

	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		
		Если СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныйРезультат = Результат.НайтиПоЗначению(СтрокаДерева.ТаблицаИнтеграции);
		Если НайденныйРезультат = Неопределено Или Не НайденныйРезультат.Пометка Тогда
			СтрокаДерева.Модифицированность = Ложь;
		Иначе
			СтрокаДерева.Модифицированность = Истина;
			МодифицированностьТаблицИнтеграции = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Если МодифицированностьТаблицИнтеграции Тогда
		ПодключитьОбработчикОжидания("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОписаниеТипаСписок = Новый ОписаниеТипов("СписокЗначений");
	Если ОписаниеТипаСписок.ПривестиЗначение(Результат).Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	МодифицированностьТаблицИнтеграции = Ложь;

	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		
		Если СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныйРезультат = Результат.НайтиПоЗначению(СтрокаДерева.ТаблицаИнтеграции);
		Если НайденныйРезультат = Неопределено Или Не НайденныйРезультат.Пометка Тогда
			СтрокаДерева.Модифицированность = Ложь;
		Иначе
			СтрокаДерева.Модифицированность = Истина;
			МодифицированностьТаблицИнтеграции = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Если МодифицированностьТаблицИнтеграции Тогда
		ПодключитьОбработчикОжидания("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаписатьТаблицуИнтеграцииВМУНаСервере(ТаблицаИнтеграции)
	
	РегистрыСведений.SUI_ТаблицыКПерезаписиВМУ.Добавить(ТаблицаИнтеграции);
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
		НСтр("ru = 'Таблица %1 будет перезаписана во всех мобильных устройствах.'"), ТаблицаИнтеграции));

КонецПроцедуры

#КонецОбласти
